START_COMMAND_TEXT = (
    "Привет, {fullname}!\nЯ телеграм бот, который может помочь вам получить ответы на "
    "ваши вопросы или просто пообщаться.\nДля более детальной информации отправьте "
    "команду /help.\nПриятного общения!"
)

HELP_COMMAND_TEXT = (
    "Данный проект реализует телеграм бота, который взаимодействует с моделью OpenAI "
    "GPT-3.5 для предоставления ответов на сообщения пользователей. Бот использует "
    "библиотеку aiogram для работы с Telegram API и Python SDK OpenAI для "
    "взаимодействия с моделью GPT-3.5.\n\nДля получение ответа просто отправьте ваш "
    "промпт (запрос) и ожидайте ответ, оно займет некоторое время."
)

BOT_ERROR_TEXT = (
    "Произошла ошибка бота, попробуйте повторить свой запрос через некоторое время"
)
